# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

list_type = ['Один', 1, True, 1.0]
for i in range(len(list_type)):
    print(type(list_type[i] ))
